app/controllers/posts_controller.rb

  def create
    p = post_params
    user = User.find(p[:id])
    if user.posts.create(body: p[:body], submitter: current_user.id)
      flash[:notice] = 'Post was uccessfully created.'
    else
      if user.posts.create(body: p[:body], submitter: current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "posts" ("user_id", "body", "created_at", "updated_at", "submitter") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["body", "a\n"], ["created_at", "2022-04-12 15:50:40.702993"], ["updated_at", "2022-04-12 15:50:40.702993"], ["submitter", 2]]
INSERT INTO "posts" ("user_id", "body", "created_at", "updated_at", "submitter") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["body", "a"], ["created_at", "2022-04-12 14:33:47.432171"], ["updated_at", "2022-04-12 14:33:47.432171"], ["submitter", 2]]