app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "student"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY created_at desc  [["user_id", 1]]
---
  def show

    @user = User.find(params[:id])
    @students = User.where(role: 'student') if @user.role == 'teacher'
    @posts = Post.where(user_id: @user.id).order('created_at desc')